Revit 2027 API
IndependentTag.GetTaggedReferences Method
 Get the host references of the tag. An array of all the tagged references.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<Reference> GetTaggedReferences()
Public Function GetTaggedReferences As IList(Of Reference)
public:
IList<Reference^>^ GetTaggedReferences()
member GetTaggedReferences : unit -> IList<Reference>
Return Value
IList<Reference>
Remarks
 The references can be to an element or subelement in a local or linked document.
See Also
Reference
IndependentTag Class
Autodesk.Revit.DB Namespace